products/app/serializers/api/v1/product_image_serializer.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def initialize(product:)
        @product = product
        id = @product.category_id
        @category = Category.find(id)