products/app/controllers/api/v1/category_controller.rb

      def create
        category = Category.create!(category_params)
---
INSERT INTO "categories" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Phones"], ["description", "Mobile phones and tablets"], ["created_at", "2020-11-19 09:02:24.964271"], ["updated_at", "2020-11-19 09:02:24.964271"]]

      def destroy
        category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      def update
        category = Category.find(params[:id])
        category.assign_attributes(category_params)
        if category.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "Television, Cameras and Home audio systems"], ["updated_at", "2020-11-19 09:05:01.355829"], ["id", 3]]