products/app/controllers/api/v1/products_controller.rb

      def create
        product = Product.create!(product_params)
        if product.save
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2020-11-19 13:45:16.518264"], ["id", 4]]

      def destroy
        product = Product.find(params[:id])
        if product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 2]]