customers/app/controllers/api/v1/customers_controller.rb

      def find_all
        @customers = Customer.all
---
SELECT "customers".* FROM "customers"

      def create
        @customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("username", "firstname", "lastname", "address", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

      def find_by_id
        @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]