customers/app/controllers/api/v1/customers_controller.rb

      def find_all
        @customers = Customer.all
---
SELECT "customers".* FROM "customers"