orders/app/controllers/api/v1/orders_controller.rb

      def create
        order = Order.create!(order_params)
---
INSERT INTO "orders" ("amount", "status", "customer", "order_detail", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"